hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
void (*send_usart_data_function_g)() = NULL;
void (*on_response_g)() = NULL;
volatile unsigned int send_usart_data_time_counter_g;
volatile unsigned short send_usart_data_timout_sec_g = 0xFFFF;
volatile unsigned char send_usart_data_errors_counter_g;
volatile unsigned short send_usart_data_errors_unresetable_counter_g;
volatile unsigned int last_error_task_g;
volatile unsigned short network_searching_status_led_counter_g;
volatile unsigned short response_timeout_timer_g;
volatile unsigned char esp8266_disabled_counter_g;
volatile unsigned char esp8266_disabled_timer_g = TIMER14_5S;
unsigned short checking_connection_status_and_server_availability_timer_g;
volatile unsigned short visible_network_list_timer_g = TIMER14_10MIN;
volatile unsigned short beeper_inactive_timer_g;
volatile unsigned short immobilizer_relay_anti_jitter_timer_g;
volatile unsigned char beeper_interval_timer_g;
volatile unsigned char beeper_alarm_prior_to_response_period_timer_g;
volatile unsigned char inactive_alarm_trigger_timer_g;
volatile unsigned char resets_occured_g;
volatile unsigned short immobilizer_inactivity_timer_g;

volatile unsigned short usart_overrun_errors_counter_g;
volatile unsigned short usart_idle_line_detection_counter_g;
volatile unsigned short usart_noise_detection_counter_g;
volatile unsigned short usart_framing_errors_counter_g;

void IWDG_Config();
void Clock_Config();
void Pins_Config();
void TIMER3_Confing();
void TIMER14_Confing();
void EXTERNAL_Interrupt_Config();
unsigned char handle_disable_echo_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_connection_status_and_connect_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_connection_status_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_connect_to_network_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_connect_to_server_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_set_bytes_to_send_in_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_request_sent_and_response_received_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_current_default_wifi_mode_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_set_default_station_wifi_mode_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_own_ip_address_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_set_own_ip_address_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_close_connection_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_server_availability_flag(unsigned int current_piped_task_to_send);
unsigned char handle_get_server_availability_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_send_alarm_flag(unsigned int current_piped_task_to_send);
unsigned char handle_send_alarm_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_send_immobilizer_activated_flag(unsigned int current_piped_task_to_send);
unsigned char handle_send_immobilizer_activated_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
unsigned char handle_get_visible_network_list_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag);
void reset_device_state();
void beep(unsigned char *beeper_counter, unsigned char activate_beeper, unsigned char server_received_ack, void (*on_server_received)());
void turn_beeper_on();
void turn_beeper_off();
void set_flag(unsigned int *flags, unsigned int flag_value);
void reset_flag(unsigned int *flags, unsigned int flag_value);
unsigned char read_flag(unsigned int *flags, unsigned int flag_value);
void DMA_Config();
void USART_Config();
void disable_echo();
void get_network_list();
void connect_to_network();
void get_connection_status();
void schedule_function_resending(void (*function_to_execute)(), unsigned char timeout, ImmediatelyFunctionExecution execute);
void send_usard_data(char string[]);
unsigned char is_usart_response_contains_elements(char *data_to_be_contained[], unsigned char elements_count);
unsigned char is_usart_response_contains_element(char string_to_be_contained[]);
unsigned char contains_string(char being_compared_string[], char string_to_be_contained[]);
void clear_usart_data_received_buffer();
unsigned short get_received_data_length();
unsigned char is_received_data_length_equal(unsigned short length);
void *set_string_parameters(char string[], char *parameters[]);
unsigned short get_string_length(char string[]);
unsigned char is_string_starts_with(char long_string[], char short_string[]);
unsigned int get_current_piped_task_to_send();
void delete_current_piped_task();
void add_piped_task_to_send_into_tail(unsigned int task);
void add_piped_task_to_send_into_head(unsigned int task);
void delete_piped_task(unsigned int task);
void on_successfully_receive_general_actions();
void prepare_http_request_without_parameters(char request_template[], unsigned int request_task);
void prepare_http_request(char address[], char port[], char request[], void (*on_response)(), unsigned int request_task);
void resend_usart_get_request_using_global_final_task();
void *num_to_string(unsigned int number);
void *array_to_string(char array[], unsigned char array_length);
void connect_to_server();
void resend_usart_get_request(unsigned int final_task);
void set_bytes_amount_to_send();
void send_request(unsigned int sent_flag_to_set);
void get_current_default_wifi_mode();
void set_default_wifi_mode();
void enable_esp8266();
void disable_esp8266();
void disable_immobilizer();
void enable_immobilizer();
unsigned char is_immobilizer_enabled();
unsigned char is_esp8266_enabled(unsigned char include_timer);
void clear_piped_request_commands_to_send();
void delete_all_piped_tasks();
unsigned char is_piped_task_to_send_scheduled(unsigned int task);
unsigned char is_piped_tasks_scheduler_full();
unsigned char is_piped_tasks_scheduler_empty();
void schedule_global_function_resending_and_send_request(unsigned int flag);
void get_server_avalability(unsigned int request_task);
void send_alarm(unsigned int request_task);
void send_immobilizer_activity(unsigned int request_task);
void get_own_ip_address();
void set_own_ip_address();
void close_connection();
void add_error();
void check_connection_status_and_server_availability(unsigned short *counter);
void add_piped_task_into_history(unsigned int task);
unsigned int get_last_piped_task_in_history();
void *get_received_usart_error_data();
void save_default_access_point_gain();
void start_immobilizer_relay_anti_jitter_timer();
unsigned char is_immobilizer_relay_status_ready_to_be_read();
void reset_immobilizer_relay_status();
void reset_immobilizer_activated_server_received_flag();

void SysTick_Handler() {
   if (GPIO_ReadOutputDataBit(BEEPER_PORT, BEEPER_PIN)) {
      GPIO_WriteBit(BEEPER_PORT, BEEPER_PIN, Bit_RESET);
   } else {
      GPIO_WriteBit(BEEPER_PORT, BEEPER_PIN, Bit_SET);
   }
}

