hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
         // LED blinking
         if (!read_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG) && network_searching_status_led_counter_g >= TIMER3_100MS) {
            network_searching_status_led_counter_g = 0;

            if (GPIO_ReadOutputDataBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            } else {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
         }

         if (read_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
         } else {
            reset_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
         }
         if (read_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG)) {
            //GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
         } else {
            //GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
         }

         if (send_usart_data_errors_counter_g >= 5 || is_piped_tasks_scheduler_full()) {
            reset_device_state();
         }
         if (resets_occured_g >= 10) {
            NVIC_SystemReset();
         }

         unsigned char activate_beeper = 0;
         if (!is_immobilizer_enabled() && !immobilizer_inactivity_timer_g) {
            enable_immobilizer();
         }
         if (is_immobilizer_enabled() && is_immobilizer_relay_status_ready_to_be_read()) {
            if (GPIO_ReadInputDataBit(IMMOBILIZER_RELAY_PORT, IMMOBILIZER_RELAY_PIN)) {
               add_piped_task_to_send_into_tail(SEND_IMMOBILIZER_ACTIVATED_FLAG);
               activate_beeper = 1;
               immobilizer_inactivity_timer_g = TIMER14_5S; // Will be restored after 30s + this value
               disable_immobilizer();
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
            } else {
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
            }
            reset_immobilizer_relay_status();
         }

         if (read_flag(&general_flags_g, ALARM_FLAG) && is_piped_tasks_scheduler_empty()) {
            add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
            reset_flag(&general_flags_g, ALARM_FLAG);
         }

         beep(&beeper_counter, activate_beeper, read_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_SERVER_RECEIVED_FLAG), reset_immobilizer_activated_server_received_flag);
      } else if (esp8266_disabled_counter_g >= TIMER14_1S) {
         esp8266_disabled_counter_g = 0;
         enable_esp8266();
         enable_immobilizer();
      }

      IWDG_ReloadCounter();
   }
}

unsigned char handle_disable_echo_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
      not_handled = 0;
      schedule_function_resending(disable_echo, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, DISABLE_ECHO_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, DISABLE_ECHO_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         on_successfully_receive_general_actions();
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_connection_status_and_connect_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_CONNECTION_STATUS_AND_CONNECT_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_connection_status, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) || is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         on_successfully_receive_general_actions();

         if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
            // Has already been connected
            set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
            reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
            // Connect
            add_piped_task_to_send_into_head(CONNECT_TO_NETWORK_FLAG);
         }
      } else {
         reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_connection_status_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_CONNECTION_STATUS_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_connection_status, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_CONNECTION_STATUS_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) || is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         on_successfully_receive_general_actions();

         if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
            // Has already been connected
            set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
            reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         }
      } else {
         reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_connect_to_network_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
      not_handled = 0;
      schedule_function_resending(connect_to_network, 10, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, CONNECT_TO_NETWORK_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, CONNECT_TO_NETWORK_FLAG);

