hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
      if (is_usart_response_contains_element(USART_OK)) {
         on_successfully_receive_general_actions();

         set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_connect_to_server_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
      not_handled = 0;
      schedule_function_resending(connect_to_server, 10, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, CONNECT_TO_SERVER_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2) || is_usart_response_contains_element(ESP8226_RESPONSE_ALREADY_CONNECTED)) {
         on_successfully_receive_general_actions();
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_set_bytes_to_send_in_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SET_BYTES_TO_SEND_IN_REQUEST_FLAG) {
      not_handled = 0;
      schedule_function_resending(set_bytes_amount_to_send, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, SET_BYTES_TO_SEND_IN_REQUEST_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, SET_BYTES_TO_SEND_IN_REQUEST_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_START_SENDING_READY)) {
         on_successfully_receive_general_actions();
      } else {
         //resend_usart_get_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_request_sent_and_response_received_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG) {
      not_handled = 0;
      schedule_global_function_resending_and_send_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
   } else if (read_flag(sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_SUCCSESSFULLY_SENT, ESP8226_RESPONSE_PREFIX};
      if (is_usart_response_contains_elements(data_to_be_contained, 2)) {
         on_successfully_receive_general_actions();
      } else {
         //resend_usart_get_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_current_default_wifi_mode_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_CURRENT_DEFAULT_WIFI_MODE_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_current_default_wifi_mode, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_MODE_PREFIX)) {
         on_successfully_receive_general_actions();

         if (!is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_STATION_MODE)) {
            add_piped_task_to_send_into_head(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
         }
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_set_default_station_wifi_mode_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SET_DEFAULT_STATION_WIFI_MODE_FLAG) {
      not_handled = 0;
      schedule_function_resending(set_default_wifi_mode, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, SET_DEFAULT_STATION_WIFI_MODE_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         on_successfully_receive_general_actions();
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_get_own_ip_address_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_OWN_IP_ADDRESS_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_own_ip_address, 5, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_OWN_IP_ADDRESS_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG);

      if (is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS) || is_usart_response_contains_element(ESP8226_RESPONSE_CURRENT_OWN_IP_ADDRESS_PREFIX)) {
         on_successfully_receive_general_actions();

         unsigned char some_another_ip = !is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS);
         if (some_another_ip) {
            add_piped_task_to_send_into_head(SET_OWN_IP_ADDRESS_FLAG);
         }
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_set_own_ip_address_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SET_OWN_IP_ADDRESS_FLAG) {
      not_handled = 0;
      schedule_function_resending(set_own_ip_address, 2, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, SET_OWN_IP_ADDRESS_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, SET_OWN_IP_ADDRESS_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         on_successfully_receive_general_actions();
      } else {
         add_error();
      }
   }
   return not_handled;
}

unsigned char handle_close_connection_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == CLOSE_CONNECTION_FLAG) {
      not_handled = 0;
      schedule_function_resending(close_connection, 20, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, CLOSE_CONNECTION_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, CLOSE_CONNECTION_FLAG);
      on_successfully_receive_general_actions();
   }
   return not_handled;
}

