hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
unsigned char handle_get_server_availability_flag(unsigned int current_piped_task_to_send) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_FLAG) {
      not_handled = 0;
      // Request 1 part. Preparation
      delete_piped_task(current_piped_task_to_send);
      get_server_avalability(GET_SERVER_AVAILABILITY_REQUEST_FLAG);
   }
   return not_handled;
}

unsigned char handle_get_server_availability_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_REQUEST_FLAG) {
      not_handled = 0;
      // Part 2
      schedule_global_function_resending_and_send_request(GET_SERVER_AVAILABILITY_REQUEST_FLAG);
   } else if (read_flag(sent_flag, GET_SERVER_AVAILABILITY_REQUEST_FLAG)) {
      not_handled = 0;

      if (is_usart_response_contains_element(ESP8226_RESPONSE_HTTP_STATUS_400_BAD_REQUEST)) {
         NVIC_SystemReset(); // Sometimes some error occurred
      } else if (is_usart_response_contains_element(ESP8226_RESPONSE_SUCCSESSFULLY_SENT) && !is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
         // Sometimes only "SEND OK" is received. Another data will be received later
         clear_usart_data_received_buffer();
      } else {
         reset_flag(&sent_flag_g, GET_SERVER_AVAILABILITY_REQUEST_FLAG);

         if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
            on_successfully_receive_general_actions();

            if (is_usart_response_contains_element(SERVER_STATUS_INCLUDE_DEBUG_INFO)) {
               set_flag(&general_flags_g, SEND_DEBUG_INFO_FLAG);
            } else {
               reset_flag(&general_flags_g, SEND_DEBUG_INFO_FLAG);
            }

            // Reset counter to send the next request in the time interval starting from the received time
            checking_connection_status_and_server_availability_timer_g = TIMER14_30S;
            set_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
         } else {
            add_error();
         }
      }
   }
   return not_handled;
}

unsigned char handle_send_alarm_flag(unsigned int current_piped_task_to_send) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SEND_ALARM_FLAG) {
      not_handled = 0;
      // Request 1 part. Preparation
      delete_piped_task(SEND_ALARM_FLAG);
      send_alarm(SEND_ALARM_REQUEST_FLAG);
   }
   return not_handled;
}

unsigned char handle_send_alarm_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SEND_ALARM_REQUEST_FLAG) {
      not_handled = 0;
      // Part 2
      schedule_global_function_resending_and_send_request(SEND_ALARM_REQUEST_FLAG);
   } else if (read_flag(sent_flag, SEND_ALARM_REQUEST_FLAG)) {
      not_handled = 0;

      if (is_usart_response_contains_element(ESP8226_RESPONSE_SUCCSESSFULLY_SENT) && !is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
         // Sometimes only "SEND OK" is received. Another data will be received later
         clear_usart_data_received_buffer();
      } else {
         reset_flag(&sent_flag_g, SEND_ALARM_REQUEST_FLAG);

         if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
            on_successfully_receive_general_actions();
            set_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
         } else {
            add_error();
         }
      }
   }
   return not_handled;
}

unsigned char handle_send_immobilizer_activated_flag(unsigned int current_piped_task_to_send) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SEND_IMMOBILIZER_ACTIVATED_FLAG) {
      not_handled = 0;
      // Request 1 part. Preparation
      delete_piped_task(current_piped_task_to_send);
      send_immobilizer_activity(SEND_IMMOBILIZER_ACTIVATED_REQUEST_FLAG);
   }
   return not_handled;
}

unsigned char handle_send_immobilizer_activated_request_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == SEND_IMMOBILIZER_ACTIVATED_REQUEST_FLAG) {
      not_handled = 0;
      // Part 2
      schedule_global_function_resending_and_send_request(SEND_IMMOBILIZER_ACTIVATED_REQUEST_FLAG);
   } else if (read_flag(sent_flag, SEND_IMMOBILIZER_ACTIVATED_REQUEST_FLAG)) {
      not_handled = 0;

      if (is_usart_response_contains_element(ESP8226_RESPONSE_SUCCSESSFULLY_SENT) && !is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
         // Sometimes only "SEND OK" is received. Another data will be received later
         clear_usart_data_received_buffer();
      } else {
         reset_flag(&sent_flag_g, SEND_IMMOBILIZER_ACTIVATED_REQUEST_FLAG);

         if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
            on_successfully_receive_general_actions();
            set_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_SERVER_RECEIVED_FLAG);
         } else {
            add_error();
         }
      }
   }
   return not_handled;
}

unsigned char handle_get_visible_network_list_flag(unsigned int current_piped_task_to_send, unsigned int *sent_flag) {
   unsigned char not_handled = 1;

   if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
      not_handled = 0;
      schedule_function_resending(get_network_list, 20, EXECUTE_FUNCTION_IMMEDIATELY);
   } else if (read_flag(sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      not_handled = 0;
      reset_flag(&sent_flag_g, GET_VISIBLE_NETWORK_LIST_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_VISIBLE_NETWORK_LIST_PREFIX)) {
         on_successfully_receive_general_actions();
         save_default_access_point_gain();
      } else {
         add_error();
      }
   }
   return not_handled;
}

void reset_device_state() {
   unsigned char is_alarm_occured = is_piped_task_to_send_scheduled(SEND_ALARM_FLAG);

   resets_occured_g++;
   delete_all_piped_tasks();
   clear_piped_request_commands_to_send();
   clear_usart_data_received_buffer();
   on_response_g = NULL;
   send_usart_data_function_g = NULL;

