hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
   if (received_usart_error_data_g != NULL) {
      free(received_usart_error_data_g);
      received_usart_error_data_g = NULL;
   }

   general_flags_g = 0;
   sent_flag_g = 0;
   send_usart_data_errors_counter_g = 0;

   GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);

   add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
   add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   if (is_alarm_occured) {
      add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
   }
}

void beep(unsigned char *beeper_counter, unsigned char activate_beeper, unsigned char server_received_ack, void (*on_server_received)()) {
   if (activate_beeper && !beeper_inactive_timer_g) {
      beeper_inactive_timer_g = TIMER14_60S;
      *beeper_counter = 1;
      set_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG);
      set_flag(&general_flags_g, BEEPER_ACTIVATED_SERVER_RECEIVED_AFTER_PAUSE_FLAG);
   }

   if (read_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG) && *beeper_counter && !beeper_interval_timer_g) {
      beeper_interval_timer_g = TIMER14_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_interval_timer_g = 0;
            beeper_alarm_prior_to_response_period_timer_g = TIMER14_500MS;
            reset_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG);
            break;
      }
   }

   if (server_received_ack && read_flag(&general_flags_g, BEEPER_ACTIVATED_SERVER_RECEIVED_AFTER_PAUSE_FLAG) && !read_flag(&general_flags_g, BEEPER_ACTIVATED_AFTER_PAUSE_FLAG)) {
      on_server_received();
      *beeper_counter = 1;
      set_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG);
   }

   if (read_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG) && !beeper_alarm_prior_to_response_period_timer_g && *beeper_counter && !beeper_interval_timer_g) {
      beeper_interval_timer_g = TIMER14_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_interval_timer_g = 0;
            reset_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG);
            reset_flag(&general_flags_g, BEEPER_ACTIVATED_SERVER_RECEIVED_AFTER_PAUSE_FLAG);
            break;
      }
   }
}

void check_connection_status_and_server_availability(unsigned short *counter) {
   if (*counter == 0 && is_piped_tasks_scheduler_empty()) {
      *counter = TIMER14_30S;
      add_piped_task_to_send_into_tail(GET_VISIBLE_NETWORK_LIST_FLAG);
      add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_FLAG);
      add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   }
}

void schedule_global_function_resending_and_send_request(unsigned int flag) {
   final_task_for_request_resending_g = flag;
   schedule_function_resending(resend_usart_get_request_using_global_final_task, 10, DO_NOT_EXECUTE_FUNCTION_IMMEDIATELY);

   send_request(flag);
}

void add_error() {
   send_usart_data_errors_counter_g++;
   send_usart_data_errors_unresetable_counter_g++;
   last_error_task_g = get_current_piped_task_to_send();

   if (received_usart_error_data_g != NULL) {
      free(received_usart_error_data_g);
      received_usart_error_data_g = NULL;
   }
   received_usart_error_data_g = get_received_usart_error_data();
}

void get_server_avalability(unsigned int request_task) {
   char *gain = array_to_string(default_access_point_gain_g, DEFAULT_ACCESS_POINT_GAIN_SIZE);
   char *debug_info_included = read_flag(&general_flags_g, SEND_DEBUG_INFO_FLAG) ? "true" : "false";
   char *status_json;

   if (read_flag(&general_flags_g, SEND_DEBUG_INFO_FLAG)) {
      char *errors_amount_string = num_to_string(send_usart_data_errors_unresetable_counter_g);
      char *usart_overrun_errors_counter_string = num_to_string(usart_overrun_errors_counter_g);
      char *usart_idle_line_detection_counter_string = num_to_string(usart_idle_line_detection_counter_g);
      char *usart_noise_detection_counter_string = num_to_string(usart_noise_detection_counter_g);
      char *usart_framing_errors_counter_string = num_to_string(usart_framing_errors_counter_g);
      char *last_error_task_string = num_to_string(last_error_task_g);
      char *received_usart_error_data = last_error_task_g && received_usart_error_data_g != NULL ? received_usart_error_data_g : "";
      char *parameters_for_status[] = {gain, debug_info_included, errors_amount_string, usart_overrun_errors_counter_string,
            usart_idle_line_detection_counter_string, usart_noise_detection_counter_string, usart_framing_errors_counter_string,
            last_error_task_string, received_usart_error_data, NULL};
      status_json = set_string_parameters(DEBUG_STATUS_JSON, parameters_for_status);

      free(errors_amount_string);
      free(usart_overrun_errors_counter_string);
      free(usart_idle_line_detection_counter_string);
      free(usart_noise_detection_counter_string);
      free(usart_framing_errors_counter_string);
      free(last_error_task_string);

      last_error_task_g = 0;
   } else {
      char *parameters_for_status[] = {gain, debug_info_included, NULL};
      status_json = set_string_parameters(STATUS_JSON, parameters_for_status);
   }

