hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
   NVIC_InitTypeDef NVIC_InitTypeInitStructure;
   NVIC_InitTypeInitStructure.NVIC_IRQChannelPriority = 3;
   NVIC_InitTypeInitStructure.NVIC_IRQChannelCmd = ENABLE;
   NVIC_InitTypeInitStructure.NVIC_IRQChannel = MOTION_SENSOR_NVIC_IRQChannel | IMMOBILIZER_RELAY_NVIC_IRQChannel;
   NVIC_Init(&NVIC_InitTypeInitStructure);
}

void turn_beeper_on() {
   SysTick_Config(300); // 16MHz / 8 / 4kHz of Beeper
   SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);
}

void turn_beeper_off() {
   SysTick_Config(1); // Turn off
   SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);
}

void set_flag(unsigned int *flags, unsigned int flag_value) {
   *flags |= flag_value;
}

void reset_flag(unsigned int *flags, unsigned int flag_value) {
   *flags &= ~(*flags & flag_value);
}

unsigned char read_flag(unsigned int *flags, unsigned int flag_value) {
   return (*flags & flag_value) > 0 ? 1 : 0;
}

void send_usard_data(char *string) {
   send_usart_data_time_counter_g = 0;
   clear_usart_data_received_buffer();
   DMA_Cmd(USART1_TX_DMA_CHANNEL, DISABLE);
   unsigned short bytes_to_send = get_string_length(string);

   if (bytes_to_send == 0) {
      return;
   }

   DMA_SetCurrDataCounter(USART1_TX_DMA_CHANNEL, bytes_to_send);
   USART1_TX_DMA_CHANNEL->CMAR = (unsigned int) string;
   USART_ClearFlag(USART1, USART_FLAG_TC);
   DMA_Cmd(USART1_TX_DMA_CHANNEL, ENABLE);
}

/**
 * Supports only 9 parameters (1 - 9). Do not forget to call free() function on returned pointer when it's no longer needed
 *
 * *parameters - array of pointers to strings. The last parameter has to be NULL
 */
void *set_string_parameters(char string[], char *parameters[]) {
   unsigned char open_brace_found = 0;
   unsigned char parameters_amount = 0;
   unsigned short result_string_length = 0;

   for (; parameters[parameters_amount] != NULL; parameters_amount++) {
   }

   // Calculate the length without symbols to be replaced ('<x>')
   for (char *string_pointer = string; *string_pointer != '\0'; string_pointer++) {
      if (*string_pointer == '<') {
         if (open_brace_found) {
            return NULL;
         }
         open_brace_found = 1;
         continue;
      }
      if (*string_pointer == '>') {
         if (!open_brace_found) {
            return NULL;
         }
         open_brace_found = 0;
         continue;
      }
      if (open_brace_found) {
         continue;
      }

      result_string_length++;
   }

   if (open_brace_found) {
      return NULL;
   }

   for (unsigned char i = 0; parameters[i] != NULL; i++) {
      result_string_length += get_string_length(parameters[i]);
   }
   // 1 is for the last \0 character
   result_string_length++;

   char *allocated_result = malloc(result_string_length); // (string_length + 1) * sizeof(char)

   if (allocated_result == NULL) {
      return NULL;
   }

   unsigned short result_string_index = 0, input_string_index = 0;
   for (; result_string_index < result_string_length - 1; result_string_index++) {
      char input_string_symbol = string[input_string_index];

      if (input_string_symbol == '<') {
         input_string_index++;
         input_string_symbol = string[input_string_index] ;

         if (input_string_symbol < '1' || input_string_symbol > '9') {
            return NULL;
         }

         input_string_symbol -= 48; // Now it's not allocated_result char character, but allocated_result number
         if (input_string_symbol > parameters_amount) {
            return NULL;
         }
         input_string_index += 2;

         // Parameters are starting with 1
         char *parameter = parameters[input_string_symbol - 1];

         for (; *parameter != '\0'; parameter++, result_string_index++) {
            *(allocated_result + result_string_index) = *parameter;
         }
         result_string_index--;
      } else {
         *(allocated_result + result_string_index) = string[input_string_index];
         input_string_index++;
      }
   }
   *(allocated_result + result_string_length - 1) = '\0';
   return allocated_result;
}

unsigned short get_string_length(char string[]) {
   unsigned short length = 0;

   for (char *string_pointer = string; *string_pointer != '\0'; string_pointer++, length++) {
   }
   return length;
}

unsigned char is_string_starts_with(char long_string[], char short_string[]) {
   unsigned char starts_with = 1;

   for (unsigned short i = 0; short_string[i] != '\0'; i++) {
      if (long_string[i] == '\0' || long_string[i] != short_string[i]) {
         starts_with = 0;
         break;
      }
   }
   return starts_with;
}

/**
 * Do not forget to call free() function on returned pointer when it's no longer needed
 */
void *num_to_string(unsigned int number) {
   char *result_string_pointer = NULL;

   if (number == 0) {
      result_string_pointer = malloc(2);
      result_string_pointer[0] = '0';
      result_string_pointer[1] = '\0';
      return result_string_pointer;
   }

   unsigned char max_string_size;

   if (number <= 0xFF) {
      // unsigned char
      max_string_size = 3;
   } else if (number <= 0xFFFF) {
      // unsigned short
      max_string_size = 5;
   } else if (number <= 0xFFFFFF) {
      // unsigned int
      max_string_size = 8;
   } else {
      // unsigned int
      max_string_size = 10;
   }

   unsigned int divider = 1;

   for (unsigned char i = 1; i < max_string_size; i++) {
      divider *= 10;
   }

   unsigned int remaining = number;
   unsigned char string_length = 0;

   while (max_string_size > 0) {
      char result_character = (char) (remaining / divider);

      if (result_string_pointer == NULL && result_character) {
         result_string_pointer = malloc(max_string_size + 1);
         string_length = max_string_size;
      }
      if (result_string_pointer != NULL) {
         unsigned char index = string_length - max_string_size;
         *(result_string_pointer + index) = result_character + 48;
      }

      remaining -= result_character * divider;
      divider /= 10;
      max_string_size--;
   }
   result_string_pointer[string_length] = '\0';
   return result_string_pointer;
}

/**
 * Do not forget to call free() function on returned pointer when it's no longer needed
 */
void *array_to_string(char array[], unsigned char array_length) {
   char *result = malloc(array_length + 1);

   for (unsigned char i = 0; i < array_length; i++) {
      result[i] = array[i];
   }
   result[array_length] = '\0';
   return result;
}

void clear_usart_data_received_buffer() {
   for (unsigned short i = 0; i < USART_DATA_RECEIVED_BUFFER_SIZE; i++) {
      if (usart_data_received_buffer_g[i] == '\0') {
         break;
      }

      usart_data_received_buffer_g[i] = '\0';
   }
}

