hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
unsigned short get_received_data_length() {
   for (unsigned short i = 0; i < USART_DATA_RECEIVED_BUFFER_SIZE; i++) {
      if (usart_data_received_buffer_g[i] == '\0') {
         return i;
      }
   }
   return 0;
}

unsigned char is_received_data_length_equal(unsigned short length) {
   for (unsigned short i = 0; i < USART_DATA_RECEIVED_BUFFER_SIZE; i++) {
      if (i == length && usart_data_received_buffer_g[i] == '\0') {
         return 1;
      } else if ((i < length && usart_data_received_buffer_g[i] == '\0') ||
            i > length) {
         return 0;
      }
   }
   return 0;
}

void enable_esp8266() {
   GPIO_WriteBit(ESP8266_CONTROL_PORT, ESP8266_CONTROL_PIN, Bit_SET);
   esp8266_disabled_timer_g = TIMER14_5S;
}

void disable_esp8266() {
   GPIO_WriteBit(ESP8266_CONTROL_PORT, ESP8266_CONTROL_PIN, Bit_RESET);
   GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
   GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
}

void disable_immobilizer() {
   GPIO_WriteBit(IMMOBILIZER_ENABLE_PORT, IMMOBILIZER_ENABLE_PIN, Bit_RESET);
}

void enable_immobilizer() {
   GPIO_WriteBit(IMMOBILIZER_ENABLE_PORT, IMMOBILIZER_ENABLE_PIN, Bit_SET);
}

unsigned char is_immobilizer_enabled() {
   return GPIO_ReadOutputDataBit(IMMOBILIZER_ENABLE_PORT, IMMOBILIZER_ENABLE_PIN);
}

unsigned char is_esp8266_enabled(unsigned char include_timer) {
   return include_timer ? (GPIO_ReadOutputDataBit(ESP8266_CONTROL_PORT, ESP8266_CONTROL_PIN) && esp8266_disabled_timer_g == 0) :
         GPIO_ReadOutputDataBit(ESP8266_CONTROL_PORT, ESP8266_CONTROL_PIN);
}

void start_immobilizer_relay_anti_jitter_timer() {
   immobilizer_relay_anti_jitter_timer_g = TIMER3_100MS;
   set_flag(&general_flags_g, IMMOBILIZER_RELAY_FLAG);
}

unsigned char is_immobilizer_relay_status_ready_to_be_read() {
   return read_flag(&general_flags_g, IMMOBILIZER_RELAY_FLAG) && !immobilizer_relay_anti_jitter_timer_g;
}

void reset_immobilizer_relay_status() {
   reset_flag(&general_flags_g, IMMOBILIZER_RELAY_FLAG);
}

void reset_immobilizer_activated_server_received_flag() {
   reset_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_SERVER_RECEIVED_FLAG);
}
